name: "ensemble"
max_batch_size: 0 
platform: "ensemble"

input [
    {
        name: "IMAGE"
        data_type: TYPE_INT64
        dims: [-1, -1, -1, -1]
    }
]

output [
    {
        name: "class_queries_logits"
        data_type: TYPE_FP32
        dims: [-1, -1, 151]
    },
    {
        name: "masks_queries_logits"
        data_type: TYPE_FP32
        dims: [-1, -1, -1, -1]
    }
]

#Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "improc"
            model_version: -1
            input_map {
                key: "IMAGE"
                value: "IMAGE"
            }
            output_map {
                key: "pixel_values"
                value: "pixel_values"
            }
        },
        {
            model_name: "maskformer"
            model_version: -1
            input_map {
                key: "pixel_values"
                value: "pixel_values"
            },
            output_map {
                key: "class_queries_logits"
                value: "class_queries_logits"
            }
            output_map {
                key: "masks_queries_logits"
                value: "masks_queries_logits"
            }
        }
    ]
}