name: "improc"
backend: "python"
max_batch_size: 0

input [
    {
        name: "IMAGE"
        data_type: TYPE_STRING
        dims: [-1]
    }
]

output [
    {
        name: "pixel_values"
        data_type: TYPE_FP32
        dims: [-1, 3, -1, -1]
    }
]