name: "maskformer"
backend: "onnxruntime"
max_batch_size: 0

input [
    {
        name: "pixel_values"
        data_type: TYPE_FP32
        dims: [-1, 3, -1, -1]
    }
]

output [
    {
        name: "class_queries_logits"
        data_type: TYPE_FP32
        dims: [-1, -1, 151]
    },
    {
        name: "masks_queries_logits"
        data_type: TYPE_FP32
        dims: [-1, -1, -1, -1]
    }
]